# Week 4

**Name:**Satwik Hegde *(PG--8)*<br>
**Registration Number:** 240911676<br>
**Date:** 11/02/2025

In [6]:
import numpy as np
import pandas as pd

# Program 1
Create a ```Series``` from a list of integers representing daily temperatures (in Celsius) over a week. Assign index labels as day of the week.

In [7]:
temps = np.random.randint(-10, 50, size=7)
days = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']
temp_series = pd.Series(temps, index=days)
temp_series

Monday       22
Tuesday      29
Wednesday     6
Thursday     -5
Friday        9
Saturday     30
Sunday        8
dtype: int32

Find and print the average (mean) temperature for the week.

In [8]:
print(f"Mean temperature: {np.mean(temp_series)}")

Mean temperature: 14.142857142857142

Identify and print the maximum and minimum temperatures and their respective days.

In [9]:
print(f"Maximum temperature: {np.max(temp_series)} on {temp_series.idxmax()}")
print(f"Minimum temperature: {np.min(temp_series)} on {temp_series.idxmin()}")

Maximum temperature: 30 on Saturday
Minimum temperature: -5 on Thursday

Display the temperatures greater than a specific value.

In [ ]:
val = int(input("Enter a value: "))
greater = temp_series[temp_series > val]
print(f"Temperatures greater than {val}:")
greater

Convert all temperatures to Fahrenheit.

In [ ]:
temp_series_f = (temp_series * 9/5) + 32
print("Temperatures in Fahrenheit:")
temp_series_f

Temperatures in Fahrenheit:

Monday        89.6
Tuesday       26.6
Wednesday    111.2
Thursday      96.8
Friday       120.2
Saturday     100.4
Sunday        60.8
dtype: float64

Print the days had temperatures above the average.

In [ ]:
above_avg = temp_series[temp_series > np.mean(temp_series)]
print("Temperatures above average:")
above_avg

Temperatures above average:

Monday       32
Wednesday    44
Thursday     36
Friday       49
Saturday     38
dtype: int64

# Program 2
Create a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3.

In [ ]:
import random
import string

def generate_random_name():
    return ''.join(random.choices(string.ascii_lowercase, k=7))

students = {
    'Roll No.': list(range(1, 11)),
    'Name': [generate_random_name() for _ in range(10)],
    'Gender': np.random.choice(['M', 'F'], size=10),
    'Marks1': np.random.randint(0, 100, size=10),
    'Marks2': np.random.randint(0, 100, size=10),
    'Marks3': np.random.randint(0, 100, size=10)
}

df = pd.DataFrame(data=students)
df.set_index('Roll No.', inplace=True)
df

             Name Gender  Marks1  Marks2  Marks3
Roll No.
1         fcmscwl      M      83      31      97
2         jxotvhy      M      37      97      98
3         dhuxfmd      M      76      42      43
4         eroyisa      M      80      28      18
5         qpqxkiq      M      23      51      53
6         mbkrwax      F      23       5       9
7         hgxyhgt      F      37      80      38
8         dlyozhq      F       4      65      25
9         tgflzwy      F      18      93      59
10        vjtiglu      F       7      20      21

Create a new column with total marks.

In [ ]:
df['TotalMarks'] = df['Marks1'] + df['Marks2'] + df['Marks3']
df

             Name Gender  Marks1  Marks2  Marks3  TotalMarks
Roll No.
1         fcmscwl      M      83      31      97         211
2         jxotvhy      M      37      97      98         232
3         dhuxfmd      M      76      42      43         161
4         eroyisa      M      80      28      18         126
5         qpqxkiq      M      23      51      53         127
6         mbkrwax      F      23       5       9          37
7         hgxyhgt      F      37      80      38         155
8         dlyozhq      F       4      65      25          94
9         tgflzwy      F      18      93      59         170
10        vjtiglu      F       7      20      21          48

Find the lowest marks in ```Marks1```.

In [ ]:
print(f"Lowest marks in Marks1: {np.min(df['Marks1'])}")

Lowest marks in Marks1: 4

Find the Highest marks in ```Marks2```.

In [ ]:
print(f"Highest marks in Marks2: {np.max(df['Marks2'])}")

Highest marks in Marks2: 97

 Find the average marks in ```Marks3```.

In [ ]:
print(f"Average marks in Marks3: {np.mean(df['Marks3'])}")

Average marks in Marks3: 46.1

Find student name with highest average.

In [ ]:
df['Average'] = df['TotalMarks'] / 3
df

             Name Gender  Marks1  Marks2  Marks3  TotalMarks    Average
Roll No.
1         fcmscwl      M      83      31      97         211  70.333333
2         jxotvhy      M      37      97      98         232  77.333333
3         dhuxfmd      M      76      42      43         161  53.666667
4         eroyisa      M      80      28      18         126  42.000000
5         qpqxkiq      M      23      51      53         127  42.333333
6         mbkrwax      F      23       5       9          37  12.333333
7         hgxyhgt      F      37      80      38         155  51.666667
8         dlyozhq      F       4      65      25          94  31.333333
9         tgflzwy      F      18      93      59         170  56.666667
10        vjtiglu      F       7      20      21          48  16.000000

In [ ]:
print(f"{df.loc[df['Average'].idxmax(), 'Name']} has the highest average of {df['Average'].max()}")

jxotvhy has the highest average of 77.33333333333333

Find how many students failed in ```Marks2``` (<40).

In [ ]:
print(f"Number of students failed in Marks2: {df[df['Marks2'] < 40].shape[0]}")

Number of students failed in Marks2: 4